[
    {
        "title": "NER Annotation Suite",
        "descriptions": [
            "Named Entity Recognition (NER) is a natural language processing task whose goal is to identify and classify parts of unstructured text in order to further understand and processes data.",
            "A major effort in creating an NER model is annotating a corpus of text that will be fed into the machine learning process. This application is a solution that streamlines this training step by providing a simple yet flexible user interface with tools to help integrate the data into your system.",
            "This website utilizes Angular 8 to create a single-page application that uses Angular Material for design and is hosted on an Express server using Node on an Amazon EC2."
        ],
        "image": "https://christian-budhi-hosting.s3.amazonaws.com/portfolio/ner-annotation-suite.PNG",
        "links": [
            {
                "name": "Website",
                "ref": "http://christianbudhi.com/projects/ner-annotation-suite"
            },
            {
                "name": "Github",
                "ref": "https://github.com/BudhiChristian/NER-Annotation-Suite"
            }
        ]
    },
    {
        "title": "ML Training Messaging Queue",
        "descriptions": [
            "Training a machine learning model can take up a lot of time and resources from a machine. Completing a training session can take anywhere from a couple of minutes to hours or even days, and some models may require high power machines to execute training efficiently.",
            "This project is meant to demonstrate how you can utilize Docker to easiliy containerize and deploy training workers and use RabbitMQ to queue and manage training jobs to distribute among those workers."
        ],
        "image": "https://christian-budhi-hosting.s3.amazonaws.com/portfolio/training_queue_messaging.PNG",
        "links": [
            {
                "name": "Github",
                "ref": "https://github.com/BudhiChristian/MLTrainingMessagingQueue"
            }
        ]
    },
    {
        "title": "Node + Jenkins CI/CD Pipeline",
        "descriptions": [
            "This portfolio along with some other projects listed here are hosted on an Express server using Node as a backend and an Amazon EC2 as a platform.",
            "A Continuous Integration/ Continuous Deployment pipeline has also been established using Jenkins so that any changes to the master version of the code will reflect as soon as they are merged in github."
        ],
        "image": "https://christian-budhi-hosting.s3.amazonaws.com/portfolio/jenkins.PNG",
        "links": [
            {
                "name": "Github",
                "ref": "https://github.com/BudhiChristian/Portfolio-Server"
            }
        ]
    }
]